{
  "chainId": 43114,
  "address": "0xE06fba763C2104dB5027F57f6A5Be0a0D86308af",
  "decimals": 18,
  "name": "Akitavax",
  "symbol": "AKITAX",
  "contractType": "ERC-20",
  "resourceLinks": [],
  "logoUri": "https://raw.githubusercontent.com/pangolindex/tokens/main/assets/0xE06fba763C2104dB5027F57f6A5Be0a0D86308af/logo.png",
  "description": "Akitavax is a community driven meme based cryptocurrency project that takes different approach on technologies served from other meme coins. Akitavax is not created as a common meme token project all critical decisions about the project are made by the founders, but it is created as a community meme token project that aims to involve all the enthusiasts to contribute in our social and artistic movement.\r\n\r\nTo implement this project, the token named $AKITAX is minted in line with the community driven strategy. This token is running on Avalanche Network. The reliabillity of the Avalanche Network was the most important reason for this token to be minted on this network. At the same time, the fact that the network is fast, low-cost and eco-friendly turned out to be a huge advantage. As a token that is created with zeitgeist of a Decentralized Finance (DEFI) era, Akitavax is designed to present many technologies on its interface and to adapt quickly to new technologies. The first intention of Akitavax is to be the premier community token and symbol of The Avalanche Ecosystem. Another purpose of Akitavax is to bring the Akita breed to the point it deserves among other meme tokens. Also, Akitavax set out to be the fairest and the most transparent meme token on The Avalanche Network. Even though the developer team has set the initial course for the project, Akitavax community members will play an integral role in shaping the token’s future journey. Akitavax is created via a fair launch with big part of community allocation, and it is intended that every Akitavax ecosystem component will be designed to involve AKITAX in some way, either directly (e.g. within the product) and indirectly (e.g. via a buy back and burn mechanism)."
}
